app/controllers/books_controller.rb

    def index
        if params[:user_id]
          @books = current_user.books
        else
          @books = Book.all
---
SELECT "books".* FROM "books"

    def create
        @book = @current_user.books.build book_params
        if @book.save
---
INSERT INTO "books" ("title", "isbn", "nbr_page", "summary", "publication_year", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def set_book
        @book = Book.find_by(id: params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]