app/controllers/reviews_controller.rb

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ? AND "reviews"."book_id" = ? LIMIT ?  [["user_id", 1], ["book_id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("user_id", "book_id", "stars", "comments", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["book_id", 1], ["stars", 5], ["comments", "vsvfsvfsvfvd"], ["created_at", "2020-09-05 19:28:58.699279"], ["updated_at", "2020-09-05 19:28:58.699279"]]
---
    def create
        if @review = Review.find_by(user_id: @current_user.id, book_id: params[:review][:book_id])
            flash["alert alert-info"] = "You've already reviewed this book."
            redirect_to user_book_path(@review.book.author_name, @review.book)
        else
            @review = Review.new(review_params)
            if @review.save

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def find_review
        @review = Review.find_by(id: params[:id])