app/controllers/sessions_controller.rb

    def create
        if auth_hash = auth
            @user = User.find_or_create_by_omniauth(auth_hash)
            session[:user_id] = @user.id
            flash["alert alert-info"] = "You're logged in."
            # render plain: flash["alert alert-info"]
            redirect_to user_path @user
        else
            @user = User.find_by(email: params[:email])
---
INSERT INTO "users" ("email", "password_digest", "full_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "bread@gmail.com"], ["LIMIT", 1]]