app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "full_name", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
      @user = User.new(user_params)
      if @user.save