app/models/book.rb

    def average_rating
        Review.where(book_id: id).average(:stars).to_i
---
SELECT AVG("reviews"."stars") FROM "reviews" WHERE "reviews"."book_id" = ?  [["book_id", 1]]