app/models/user.rb

    def self.find_or_create_by_omniauth(auth_hash)
        self.where(:email => auth_hash["info"]["email"]).first_or_create do |user|
---
INSERT INTO "users" ("email", "password_digest", "full_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "koreykendrick1@gmail.com"], ["LIMIT", 1]]